<h2> Pandas Basics </h2>

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.5.3'

In [3]:
np.__version__

'1.23.5'

In [4]:
a1 = np.random.randint(5, size=5)

In [5]:
a1

array([4, 4, 4, 0, 1])

In [6]:
series1 = pd.Series(a1)

In [7]:
series1

0    4
1    4
2    4
3    0
4    1
dtype: int64

In [8]:
# with user defined / custom indexing 
series2 = pd.Series(a1, index=['a','b','c','d','e'])
series2

a    4
b    4
c    4
d    0
e    1
dtype: int64

In [9]:
series1[1]

4

In [10]:
series2['c']

4

In [11]:
series2.dtype

dtype('int64')

<b> Data Frame </b>

In [12]:
d1 = {
    "id":[1,2,3,4],
    "name":["ankita", "murali", "abhishek","amit"]
}
d1

{'id': [1, 2, 3, 4], 'name': ['ankita', 'murali', 'abhishek', 'amit']}

In [13]:
df = pd.DataFrame(d1)

In [14]:
df

   id      name
0   1    ankita
1   2    murali
2   3  abhishek
3   4      amit

In [15]:
df.dtypes

id       int64
name    object
dtype: object

<b> Reading Files </b>

In [16]:
students_map = {"id":[1,2,3,4,5],
               "name":['pravin', 'patil','john','sadiq','pravin'],
               "quiz1":[5,5,3,5,5],
               "quiz2":[5,5,3,5,5],
               "assignment":[10,10,5,5,10],
               "midsem":[22,2,11,23,22],
               "compre":[34,4,33,11,34],
               }

In [19]:
df=pd.DataFrame(students_map)

In [20]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [21]:
df.name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [22]:
df.name.dtypes

dtype('O')

In [23]:
type(df.name)

pandas.core.series.Series

In [24]:
assign = df['assignment']

In [25]:
assign

0    10
1    10
2     5
3     5
4    10
Name: assignment, dtype: int64

In [26]:
type(assign)

pandas.core.series.Series

In [27]:
list_of_col = ["id", "name", "compre"]

In [28]:
extracted_df = df[list_of_col]
list_of_col

['id', 'name', 'compre']

In [29]:
extracted_df

   id    name  compre
0   1  pravin      34
1   2   patil       4
2   3    john      33
3   4   sadiq      11
4   5  pravin      34

In [30]:
extracted_df.dtypes

id         int64
name      object
compre     int64
dtype: object

In [31]:
type(extracted_df)

pandas.core.frame.DataFrame

In [32]:
extracted_df.id

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [33]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [34]:
df.head(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4

In [35]:
df.tail(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [36]:
df.describe

<bound method NDFrame.describe of    id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34>

In [37]:
df.name["pravin"]

KeyError: 'pravin'

In [38]:
df.iloc[1,2]

5

In [39]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [40]:
df.iloc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [41]:
df.iloc[0,1]

'pravin'

In [42]:
df.iloc[0:3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33

In [43]:
df.query('quiz1>3 | quiz2<4')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [46]:
df.query('quiz1>3 & quiz2>4')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34